package com.pwq.spider.chsi.common.http;

import lombok.Getter;

/**
 * 返回状态码
 * @description
 * @author heliang
 * @date 2016年8月8日 下午5:00:32
 * @version v1.0
 */
@Getter
public enum ResultCode {

    //以20开头可能是代码问题 采集出现问题 以及解析
    采集基本信息出错 ("2000","采集基本信息出错"),
    采集资产状况出错 ("2001","采集资产状况出错"),
    采集交易记录出错 ("2002","采集交易记录出错"),
    采集银行卡信息出错 ("2003","采集银行卡信息出错"),
    采集最近交易人信息出错 ("2004","采集最近交易人信息出错"),
    采集联系人信息出错 ("2005","采集联系人信息出错"),
    采集用户借呗信息出错 ("2006","采集用户借呗信息出错"),
    采集收货地址信息出错 ("2007","采集收货地址信息出错"),

    解析基本信息出错 ("2010","解析基本信息出错"),
    解析资产状况出错 ("2011","解析资产状况出错"),
    解析交易记录出错 ("2012","解析交易记录出错"),
    解析银行卡信息出错 ("2013","解析银行卡信息出错"),
    解析最近交易人信息出错 ("2014","解析最近交易人信息出错"),
    解析联系人信息出错 ("2015","解析联系人信息出错"),
    解析用户借呗信息出错 ("2016","解析用户借呗信息出错"),
    解析收货地址信息出错 ("2017","解析收货地址信息出错"),


    //以40开头可能为官网问题



    //任务
    开始抓取("","任务开始"),


    //以00开头为成功
    SUCCESS ("0000","操作成功"),
    登录成功 ("0000","登录成功"),
    爬取成功("0000","爬取成功"),
    解析成功("0000","解析成功"),
    FAILURE ("9999","官网系统繁忙，请稍后再试"),
    系统繁忙("10114","官网系统繁忙，请稍后再试"),

    ;
    //状态码
    private String code;
    //状态描述
    private String msg;

    ResultCode(String code, String msg){
        this.code = code;
        this.msg = msg;
    }

    public boolean equals(String code){
        return this.code.equals(code);
    }

    @Override
    public String toString() {
        return "ResultCode{" +
                "code='" + code + '\'' +
                ", msg='" + msg + '\'' +
                '}';
    }
}
